Revit 2024 API
BuiltInFailures.FamilyFailures.CannotRotateElement Property
 Can't rotate element into this position.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CannotRotateElement { get; }
Visual Basic
Public Shared ReadOnly Property CannotRotateElement As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CannotRotateElement {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace